{
  "backend/main.mo": "Main Motoko actor defining Product, Banner, Inquiry, and UserProfile types with CRUD operations, access control integration, and admin/user permission checks for all mutations.",
  "feature_evidence.json": "Feature evidence report mapping four main features (admin auth, product management, banner editing, inquiry management, homepage sections) to their implementing files and components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend components, pages, and hooks describing their responsibilities in the React application architecture.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes defining maroon/gold color scheme and shadcn/ui design tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Shree Radha Traders', and script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with home and protected admin routes, Layout wrapper with Header/Footer/FloatingWhatsAppButton, ProfileSetup modal, and ThemeProvider.",
  "frontend/src/components/admin/BannerForm.tsx": "Banner add/edit form with image file upload, preview, upload progress tracking, optional link field, and mutation hooks for creating or updating banners.",
  "frontend/src/components/admin/BannerManager.tsx": "Admin component for managing hero banners with CRUD operations (add, edit, delete) and displays banner images with optional links in a card grid layout.",
  "frontend/src/components/admin/InquiryCard.tsx": "Displays a single customer inquiry with contact details, message, timestamp, status badge, and controls for updating status or deleting the inquiry.",
  "frontend/src/components/admin/InquiryManager.tsx": "Admin component that fetches and displays all customer inquiries sorted by timestamp in descending order using InquiryCard components.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, category, price, and image upload with progress tracking.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin component for managing products with CRUD operations, displaying products in a responsive grid with image, details, and edit/delete actions.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity, with query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to complete their profile with name (required), email, and phone fields.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard component that checks for authentication and admin privileges, redirecting unauthorized users to home with error toasts.",
  "frontend/src/components/home/AboutSection.tsx": "Renders the About section with company description, highlighting Shree Radha Traders' wedding gift packaging services, experience, and customization options.",
  "frontend/src/components/home/CategoryFilter.tsx": "Displays a horizontal list of category filter buttons (including 'All') that allows users to filter products by category.",
  "frontend/src/components/home/ContactSection.tsx": "Renders the Contact section with contact information (phone, WhatsApp, Instagram, address), an embedded Google Map, and the InquiryForm component.",
  "frontend/src/components/home/HeroSection.tsx": "Displays the hero banner with dynamic background image from banners API, headline text, and CTA buttons for viewing products and WhatsApp ordering.",
  "frontend/src/components/home/InquiryForm.tsx": "Provides a contact form with name, phone, and message fields that submits inquiries via the useAddInquiry mutation hook.",
  "frontend/src/components/home/ProductCard.tsx": "Displays a single product card with image, name, description, and price; clicking the image triggers a lightbox view.",
  "frontend/src/components/home/ProductGallery.tsx": "Renders the product gallery section with category filtering, product grid display, loading state, and lightbox modal for product details.",
  "frontend/src/components/home/ProductLightbox.tsx": "Shows a modal dialog with enlarged product image, category, description, and price when a product card is clicked.",
  "frontend/src/components/home/WhyChooseUsSection.tsx": "Displays a grid of four benefit cards highlighting quality, wholesale pricing, fast delivery, and trust from wedding planners.",
  "frontend/src/components/layout/FloatingWhatsAppButton.tsx": "Renders a fixed floating WhatsApp button in the bottom-right corner that opens a WhatsApp chat with a pre-filled message.",
  "frontend/src/components/layout/Footer.tsx": "Displays the site footer with brand info, quick navigation links, social media icons, copyright notice, and Caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Header component with sticky navigation, logo, smooth-scrolling nav links (Home, About, Products, Contact), and a mobile-responsive menu using Sheet. Includes LoginButton and uses maroon/gold/cream theme colors.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with authentication, initializing access control with an admin token from URL params. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides useGetCallerUserProfile hook that fetches the current authenticated user's profile from the backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and status tracking. Creates AuthClient with configurable options and handles delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including products (CRUD), categories, banners (CRUD), inquiries (CRUD with status updates), and user profiles. Each mutation includes toast notifications and query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom royal wedding color palette (maroon, gold, cream, soft pink) for both light and dark modes. Includes utility classes for theme colors and sets Playfair Display for headings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabbed interface for managing Products, Banners, and Inquiries using respective manager components.",
  "frontend/src/pages/Home.tsx": "Home page component that composes HeroSection, AboutSection, ProductGallery, WhyChooseUsSection, and ContactSection into a full landing page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup. Includes getSecretParameter for sensitive data like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH color space (maroon, gold, cream, soft pink), extended theme with sidebar/chart colors, custom fonts (Inter, Playfair Display), and accordion animations.",
  "project_state.json": "Project state file defining a luxurious Indian wedding-themed website for Shree Radha Traders with admin dashboard, product management, WhatsApp integration, and royal color palette (Maroon, Gold, Cream, Soft Pink); includes feature list and image requirements."
}